{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":80,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,80],"dtype":"float32"}},{"class_name":"Dense","config":{"units":80,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":80,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dense","config":{"units":26,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}}],"keras_version":"tfjs-layers 0.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./spelling.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[80,80],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[80,80],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[80,80],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[80,26],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[26],"dtype":"float32"}]}]}